<template>
  <section class="text-block">
    <div class="container">
      <div class="grid">
        <div class="block">
          <p>
            Ослепительно белая улыбка и здоровье ваших зубов начинаются с идеальной чистоты. Наши
            процедуры профессиональной гигиены и современного отбеливания вернут вашим зубам
            природную белизну, гладкость и сияние.
          </p>

          <h3>Профессиональная гигиена — основа здоровья и красоты</h3>
          <ul>
            <li>
              Регулярное удаление зубного камня и налета там, где не справляется щетка, — лучшая
              профилактика кариеса и воспаления десен.
            </li>
            <li>
              Безболезненно и комфортно: Мы используем ультразвук и технологию Air Flow, которые
              бережно очищают эмаль.
            </li>
            <li>
              Эффективный результат: Всего за один визит мы удаляем налет и камень, полируем эмаль и
              укрепляем ее фторсодержащим гелем.
            </li>
          </ul>
          <p>Рекомендуется проводить каждые 6 месяцев.</p>
        </div>
        <div class="block">
          <h3>Современное отбеливание — ваша уверенность в улыбке</h3>
          <p>
            Мечтаете об ослепительно белой улыбке? Мы предлагаем безопасные и эффективные системы
            отбеливания.
          </p>
          <ul>
            <li>
              <strong>Контролируемый результат:</strong> Под наблюдением врача ваши зубы станут
              светлее на 6-12 тонов без вреда для эмали.
            </li>
            <li>
              <strong>Индивидуальный подход:</strong> Мы подберем метод, идеально подходящий вам:
              химическое отбеливание для глубокого осветления или щадящее механическое для удаления
              поверхностных пигментов.
            </li>
            <li>
              <strong>Долговечный эффект:</strong> Врач даст подробные рекомендации, как сохранить
              белизну зубов надолго.
            </li>
          </ul>

          <p>Подарите себе ощущение свежести и сияющую улыбку!</p>
          <p>
            Запишитесь на консультацию, и наш гигиенист составит для вас персональную программу
            ухода для достижения идеального результата.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped>
.text-block {
  padding: 100px 0;
  background: #fff;
  max-width: 1700px;
  margin: 0 auto;
}

@media (max-width: 768px) {
  .text-block {
    padding: 0;
  }
}

.grid {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  gap: 36px;
}

@media (max-width: 768px) {
  .grid {
    grid-template-columns: 1fr;
    gap: 10px;
  }
}

.block {
  color: #000;
  font-family: Inter;
  font-size: 18px;
  font-style: normal;
  font-weight: 300;
  line-height: 125%; /* 22.5px */
  display: flex;
  flex-direction: column;
  gap: 8px;
}

.block h3 {
  margin-top: 8px;
  font-size: 18px;
  font-weight: 600;
  line-height: 125%; /* 30px */
}

@media (max-width: 768px) {
  .block {
    color: #000;
    font-family: Inter;
    font-size: 10px;
    font-style: normal;
    font-weight: 300;
    line-height: 125%; /* 12.5px */
  }
}
</style>
