<template>
  <section class="text-block">
    <div class="container">
      <div class="grid">
        <div class="block">
          <p>
            Восстановите утраченные зубы и красоту улыбки с помощью современных методов
            протезирования. Мы подберем для вас оптимальное решение, которое будет комфортным,
            функциональным и эстетичным.
          </p>

          <h3>Съемные протезы: доступное и быстрое решение</h3>
          <p>
            Идеальный вариант для восстановления одного, нескольких или всех зубов. Вы можете
            самостоятельно снимать и надевать конструкцию для ухода.
          </p>
          <p>
            <strong>Виды протезов:</strong> Акриловые (пластинчатые), удобные бюгельные (на
            металлическом каркасе) и надежные протезы с фиксацией на имплантах.
          </p>
          <p>
            <strong>Преимущества:</strong> Доступная стоимость, щадящее изготовление без обточки
            зубов и возможность ремонта.
          </p>
        </div>
        <div class="block">
          <h3>Коронки: прочность и естественность</h3>
          <p>Восстановление сильно разрушенных зубов с помощью прочных и эстетичных «колпачков».</p>
          <p>
            <strong>Металлокерамика:</strong> Проверенная временем классика. Сочетание прочного
            металлического каркаса и эстетичной керамики. Отличное соотношение цены и качества,
            долгий срок службы.
          </p>
          <p>
            <strong>Безметалловая керамика:</strong> Максимальная эстетика и биосовместимость. Зуб
            выглядит абсолютно естественно, пропуская свет, как натуральная эмаль. Идеально для зоны
            улыбки. Мы используем прочные и долговечные материалы на основе диоксида циркония.
          </p>

          <p>Не откладывайте красоту и здоровье своей улыбки!</p>
          <p>
            Запишитесь на консультацию, и наш стоматолог-ортопед поможет выбрать лучший способ
            протезирования, который вернет вам уверенность и радость свободного общения.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped>
.text-block {
  padding: 100px 0;
  background: #fff;
  max-width: 1700px;
  margin: 0 auto;
}

@media (max-width: 768px) {
  .text-block {
    padding: 0;
  }
}

.grid {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  gap: 36px;
}

@media (max-width: 768px) {
  .grid {
    grid-template-columns: 1fr;
    gap: 10px;
  }
}

.block {
  color: #000;
  font-family: Inter;
  font-size: 18px;
  font-style: normal;
  font-weight: 300;
  line-height: 125%; /* 22.5px */
  display: flex;
  flex-direction: column;
  gap: 8px;
}

.block h3 {
  margin-top: 8px;
  font-size: 18px;
  font-weight: 600;
  line-height: 125%; /* 30px */
}

@media (max-width: 768px) {
  .block {
    color: #000;
    font-family: Inter;
    font-size: 10px;
    font-style: normal;
    font-weight: 300;
    line-height: 125%; /* 12.5px */
  }
}
</style>
