<template>
  <section class="text-block">
    <div class="container">
      <div class="grid">
        <div class="block">
          Являясь всего лишь частью общей картины, сделанные на базе интернет-аналитики выводы лишь
          добавляют фракционных разногласий и разоблачены. Для современного мира граница обучения
          кадров, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для
          вывода текущих активов. Банальные, но неопровержимые выводы, а также сторонники
          тоталитаризма в науке указаны как претенденты на роль ключевых факторов. В рамках
          спецификации современных стандартов.
        </div>
        <div class="block">
          Являясь всего лишь частью общей картины, сделанные на базе интернет-аналитики выводы лишь
          добавляют фракционных разногласий и разоблачены. Для современного мира граница обучения
          кадров, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для
          вывода текущих активов. Банальные, но неопровержимые выводы, а также сторонники
          тоталитаризма в науке указаны как претенденты на роль ключевых факторов. В рамках
          спецификации современных стандартов.
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped>
.text-block {
  padding: 100px 0;
  background: #fff;
  max-width: 1700px;
  margin: 0 auto;
}

.grid {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  gap: 36px;
}

.block {
  color: #000;
  font-family: Inter;
  font-size: 18px;
  font-style: normal;
  font-weight: 300;
  line-height: 125%; /* 22.5px */
}
</style>
