<template>
  <section class="text-block">
    <div class="container">
      <div class="grid">
        <div class="block">
          <p>
            Иногда сохранение зуба невозможно, и его удаление — единственный способ решить проблему
            и сохранить здоровье всей полости рта. Наши хирурги проводят удаление любой сложности
            максимально бережно, безопасно и с гарантией комфорта для пациента.
          </p>

          <h3>Когда необходимо удаление?</h3>
          <ul>
            <li>Сильное разрушение, когда зуб невозможно восстановить пломбой или коронкой.</li>
            <li>Осложненный пульпит или периодонтит, угрожающий распространением инфекции.</li>
            <li>Неправильное положение зуба, травмирующее слизистую или мешающее прикусу.</li>
            <li>
              Ретинированные и дистопированные зубы (чаще всего «зубы мудрости»), которые не
              прорезались, вызывают боль, воспаление или скученность других зубов.
            </li>
          </ul>
        </div>
        <div class="block">
          <h3>Как проходит процедура?</h3>
          <p>Удаление проводится с современной анестезией, поэтому процесс безболезненный.</p>
          <ul>
            <li>
              <strong>Диагностика:</strong> Перед процедурой выполняется рентген-снимок для оценки
              состояния корней и планирования.
            </li>
            <li><strong>Анестезия:</strong> Подбирается эффективный обезболивающий препарат.</li>
            <li>
              <strong>Извлечение зуба:</strong> Врач аккуратно извлекает зуб, минимизируя травму
              окружающих тканей. Сложные зубы предварительно разделяются на части.
            </li>
            <li>
              <strong>Рекомендации:</strong> После операции мы дадим подробные советы по уходу за
              лункой для быстрого заживления.
            </li>
          </ul>

          <h3>Сложное удаление: ретинированные зубы</h3>
          <p>
            Мы специализируемся на удалении ретинированных зубов (оставшихся в кости). Эта процедура
            требует особого мастерства хирурга. Мы проводим ее с ювелирной точностью, чтобы избежать
            осложнений и сохранить здоровье соседних зубов.
          </p>

          <p>Доверьте здоровье своей улыбки профессионалам!</p>
          <p>
            Не откладывайте визит к хирургу. Запишитесь на консультацию, и мы предложим лучшее
            решение для вашей ситуации.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<style scoped>
.text-block {
  padding: 100px 0;
  background: #fff;
  max-width: 1700px;
  margin: 0 auto;
}

@media (max-width: 768px) {
  .text-block {
    padding: 0;
  }
}

.grid {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  gap: 36px;
}

@media (max-width: 768px) {
  .grid {
    grid-template-columns: 1fr;
    gap: 10px;
  }
}

.block {
  color: #000;
  font-family: Inter;
  font-size: 18px;
  font-style: normal;
  font-weight: 300;
  line-height: 125%; /* 22.5px */
  display: flex;
  flex-direction: column;
  gap: 8px;
}

.block h3 {
  margin-top: 8px;
  font-size: 18px;
  font-weight: 600;
  line-height: 125%; /* 30px */
}

@media (max-width: 768px) {
  .block {
    color: #000;
    font-family: Inter;
    font-size: 10px;
    font-style: normal;
    font-weight: 300;
    line-height: 125%; /* 12.5px */
  }
}
</style>
